{
  "date": "Wednesday July 15th, 2017",
  "body": "<!--EndFragment-->\n\nAnd the water receded is a sonification of Hurricane Katrina for three players and electronics. The listener will experience the track of the storm from its forming into a tropical depression on August 23, 2005 to its strengthening into a Hurricane and landfall in New Orleans on August 29, 2005. Hearing this on a reduced timescale allows for a greater appreciation of the magnitude of the event because it can be perceived in one sitting.\n\nHaving lived my entire life in New Orleans, I had seen many hurricanes. For some reason though as it was approaching it didn’t seem like a big deal. My family evacuated many times while I was growing up; we always returned within a few days. Because of this lack of experiencing it the first time, I wanted to make it perceptible for myself and others. Working on this piece was also a sort of therapy. I had never done any art about the storm and hadn’t processed my emotions from the event like I probably should have. Being with the piece forces a reflection on that time.\n\nAnimated notation was used to aid in the realization of the sonification. It allowed a synchronization between the electronics and instrumentalists, and aided a slow rhythmic acceleration that was directly related to the data.\n\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/es_4M9t9K-4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<!--StartFragment-->\n\n<br/>\n\n<iframe width=\"100%\" height=\"20\" title=\"And the water receded\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/330625041&amp;color=95bcda&amp;inverse=false&amp;auto_play=false&amp;show_user=false\"></iframe>\n\n<!--EndFragment-->\n\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/jNDyT-eDkGc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<!--EndFragment-->\n\n- - -\n\n## Performances\n\n* International Computer Music Conference and New York Electroacoustic Music\n  Festival; Hebrew Union College; New York, New York, June 16-23, 2019\n* New Music on the Bayou, Ruston Artisans; Ruston, Louisiana; May 31, 2018\n* Signal Flow, Littlefield Concert Hall, Mills College,\n  March 12, 2017",
  "title": "And the water receded (2017)",
  "category": "Live Electroacoustic Music"
}